Tekla Open API Reference for Tekla Structures 2025
ModelHandler Methods
The ModelHandler type exposes the following members.
Methods
Name | Description
Close
Closes current model.
CreateNewMultiUserModel
 Creates a new multi-user model.
CreateNewSingleUserModel
 Creates a new single user model.
IsModelAutoSaved
Tells whether a model has auto saved information.
IsModelSaved
Tells whether current model has been saved.
Open
Opens a new model to Tekla Structures without saving changes to current model.
Save(String, String)
 Saves current model with comment and user information.
Save(String, String, String)
 Saves current model with comment and user information.
Top
See Also
Reference
ModelHandler Class
Tekla.Structures.Model Namespace